package javaOOP.homeWork6.Task1;
import javaOOP.homeWork6.Task1.Models.User;

/**
 * Реструктуризировать проект HomeWork с учетом теоретических основ SOLID’а
 * * Написать проект, "Записки", содержащий работу с записками из консоли (можно прочитать все записки, создать одну записку, отредактировать записку, удалить, и
 * прочитать одну записку по ID), записка содержит в себе как минимум 3 поля Id, заголовок и текст, можно добавить дату. Хранение по вашему выбору, можно в текстовом
 * файле (или каждая записка в одном файле, как вам удобнее). Можно сделать по аналогии с программой из 5 урока.
 */

public class Main{
	public static void main(String[] args){
		User user = new User("Bob");
		user.report();
		user.save();
	}
}