package semLesson1.Task1;

import java.time.LocalDateTime;

public class Task1 {
//Настроить проект, вывести в консоль “Hello world!”.
//Вывести в консоль системные дату и время.
    public static void hello() {
        System.out.println("Hello");
        System.out.println(LocalDateTime.now());
    }
}
